vim-cheatsheet.org
#+title: VIM Cheat Sheet
#+author: Manos Vasilakis (advizor.gr)
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./css/style.css" />

* VIM Cheatsheet
A lifetime worth of vim knowledge in a file.
** Basics
*** Basic Movements & Commands
#+BEGIN_EXAMPLE
+-----------------+   For Japanese users, Hiroshi Iwatani suggested using this:
|  Movements:     | -----------------------------------------------------------
+-----------------+                   Komsomolsk
|                 |                       ^
|       ^         |                       |
|       k         |          Huan Ho  <---0---> Los Angeles
| < h       l >   |	(Yellow river)    |
|       j         |                       v
|       v         |                       Java (the island,
|                 |                       not the programming language)
+-----------------+

Basic Commands:
- :q! → Exit discarding anything you did.(cause u suck!)
- x   → Delete Char. (Normal Mode, N.M.)
- i   → Insert (move cursor, press i and insert text) (N.M)
- A   → Append ("--") (N.M.)
- wq  → Exit and Save Changes.
- dw  → DeleteWord after cursor (N.Mode)
- d$  → Delete Until End Of Line (N.M.)
#+END_EXAMPLE
*** Cursor Location & File Status
- CTRL + G → Shows Ur Location in file & file status.
- G    → Move to Bottom of File
- gg   → Move to Top of File.

*** Search Command / and ?
- /test
   - Searches for "skatata"
   - press n to Find Next
   - press N to Find Next on Opposite Direction.
- ?skatata
   - Searches for "skatata" on the Opposite Direction.
   - Press CTRL + O to go back where you came, keep pressing o, to repeat
   - Press CTRL + I to go Forward.

*** Matching (Parenthesis)
- % → Place cursor on any (,[,{ and type % to find it's match ),] or }.
*** Searching
- /term
  - Searches for the term 'term'
  - Press 'n' and 'b' to go back and forth.

*** Substitution
   #+BEGIN_EXAMPLE
    :s/old/new	    → Change first occurence of "old" to "new".
    :s/old/new/     → Adding the g Flag makes it Global
			  all occurences of "thee" replaced.
    :#,#s/old/new/g → where #,# are the line numbers of the range
		      of lines where the substitution is to be done.
    :%s/old/new/gc  → to find every occurrence in the whole file,
		      with a prompt whether to substitute or not.
   #+END_EXAMPLE

*** Execute External Commands:
- !ls → Execute ls command inside vim.

*** Make External copy of current file:
- :w NewFile
   - Make exact copy of current file as NewFile.
   - To save part of the file, type v, select and :w NewFile.

*** Retrieve & Merge Files:
- :r Filename
   - Insert the contents of the file Filename into the current one.
- :r !ls
   - Insert the output of ls command under your cursor <3LifeHack.

*** To go insert mode:
- o → open Command, puts you in I mode, to the line bellow the cursor.
- O → Open Command, puts you in I mode, to the line Above the cursor.
- a → Append Command, Puts you to I mode (almost same as i, A)
- A → Append Command, Puts you to I mode, append text at the end of line.

*** Basic Text Manipulation
- R → Replace Command, Replace More than One Character.
- y → yank=copy, type v, select text you need, type y to yank.
- p → put=paste, move the cursor where you want, type p to put that you yanked.

*** set option :set
- :set ic
   - Type :set ic and /skata to search for skata (ic=IgnoreCase).
   - Type :set noic to Disable Ingoring Case.
   - Type /skata\c to Ignore Case for just this search.
   - Type :set hls is and /skata to highligt all skata occurences.
   - Type :nohlsearch to remove the highlightings.

** Vim Language Synopsis
Vim's killer feature is the language it provides for making changes.
#+BEGIN_EXAMPLE
The Syntax of the VIM Language:
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    - Verb + Noun

    - d for Delete }
		   } => Delete Word :)
    - w for Word   }

- Commands are: Repeatable & Undoable.
#+END_EXAMPLE

