html/vim-cheatsheet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-16 Thu 22:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>VIM Cheat Sheet</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Manos Vasilakis (advizor.gr)" />
<link rel="stylesheet" type="text/css" href="./css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">VIM Cheat Sheet</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3b6df5b">1. VIM Cheatsheet</a>
<ul>
<li><a href="#orgcd4b8c3">1.1. Basics</a>
<ul>
<li><a href="#org152b99a">1.1.1. Basic Movements &amp; Commands</a></li>
<li><a href="#org70c97a9">1.1.2. Cursor Location &amp; File Status</a></li>
<li><a href="#org2556feb">1.1.3. Search Command / and ?</a></li>
<li><a href="#orge1c6733">1.1.4. Matching (Parenthesis)</a></li>
<li><a href="#org3ed0cf2">1.1.5. Searching</a></li>
<li><a href="#orgd684e84">1.1.6. Substitution</a></li>
<li><a href="#orgd5bedfc">1.1.7. Execute External Commands:</a></li>
<li><a href="#orgdcebd36">1.1.8. Make External copy of current file:</a></li>
<li><a href="#org7be4b1f">1.1.9. Retrieve &amp; Merge Files:</a></li>
<li><a href="#org4d866b7">1.1.10. To go insert mode:</a></li>
<li><a href="#orgbaccb1b">1.1.11. Basic Text Manipulation</a></li>
<li><a href="#org48e718d">1.1.12. set option :set</a></li>
</ul>
</li>
<li><a href="#orgd7afbe5">1.2. Vim Language Synopsis</a>
<ul>
<li><a href="#org4b83ad2">1.2.1. Verbs and Nouns in VimL</a></li>
</ul>
</li>
<li><a href="#org351ad4d">1.3. Some built-in configuration additions</a>
<ul>
<li><a href="#org92065d1">1.3.1. Fuzzy Buffer File Search</a></li>
<li><a href="#orga280d46">1.3.2. Tag Jumping</a></li>
<li><a href="#org97428ef">1.3.3. Autocomplete</a></li>
<li><a href="#org825ff29">1.3.4. File Browsing</a></li>
<li><a href="#orgbf18d48">1.3.5. Snippets</a></li>
<li><a href="#orgd8ec742">1.3.6. Build Integration</a></li>
</ul>
</li>
<li><a href="#orgefd73d3">1.4. NeoVim User Manual Synopsis</a>
<ul>
<li><a href="#orgf9260c4">1.4.1. <code>usr_02.txt</code>: First Steps in Vim</a></li>
<li><a href="#orgd242270">1.4.2. <code>usr_03.txt</code>: Moving Around</a></li>
<li><a href="#orgf8ef476">1.4.3. <code>usr_04.txt</code>: Making Small Changes</a></li>
<li><a href="#org0e94216">1.4.4. more someday&#x2026;</a></li>
</ul>
</li>
<li><a href="#orgb3dca9c">1.5. Let vim do the typing</a></li>
<li><a href="#orgb66c9af">1.6. More Unsorted Magic</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3b6df5b" class="outline-2">
<h2 id="org3b6df5b"><span class="section-number-2">1</span> VIM Cheatsheet</h2>
<div class="outline-text-2" id="text-1">
<p>
A lifetime worth of vim knowledge in a file.
</p>
</div>
<div id="outline-container-orgcd4b8c3" class="outline-3">
<h3 id="orgcd4b8c3"><span class="section-number-3">1.1</span> Basics</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org152b99a" class="outline-4">
<h4 id="org152b99a"><span class="section-number-4">1.1.1</span> Basic Movements &amp; Commands</h4>
<div class="outline-text-4" id="text-1-1-1">
<pre class="example" id="org10907af">
+-----------------+   For Japanese users, Hiroshi Iwatani suggested using this:
|  Movements:     | -----------------------------------------------------------
+-----------------+                   Komsomolsk
|                 |                       ^
|       ^         |                       |
|       k         |          Huan Ho  &lt;---0---&gt; Los Angeles
| &lt; h       l &gt;   |	(Yellow river)    |
|       j         |                       v
|       v         |                       Java (the island,
|                 |                       not the programming language)
+-----------------+

Basic Commands:
- :q! → Exit discarding anything you did.(cause u suck!)
- x   → Delete Char. (Normal Mode, N.M.)
- i   → Insert (move cursor, press i and insert text) (N.M)
- A   → Append ("--") (N.M.)
- wq  → Exit and Save Changes.
- dw  → DeleteWord after cursor (N.Mode)
- d$  → Delete Until End Of Line (N.M.)
</pre>
</div>
</div>
<div id="outline-container-org70c97a9" class="outline-4">
<h4 id="org70c97a9"><span class="section-number-4">1.1.2</span> Cursor Location &amp; File Status</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>CTRL + G → Shows Ur Location in file &amp; file status.</li>
<li>G    → Move to Bottom of File</li>
<li>gg   → Move to Top of File.</li>
</ul>
</div>
</div>

<div id="outline-container-org2556feb" class="outline-4">
<h4 id="org2556feb"><span class="section-number-4">1.1.3</span> Search Command / and ?</h4>
<div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li>/test
<ul class="org-ul">
<li>Searches for "skatata"</li>
<li>press n to Find Next</li>
<li>press N to Find Next on Opposite Direction.</li>
</ul></li>
<li>?skatata
<ul class="org-ul">
<li>Searches for "skatata" on the Opposite Direction.</li>
<li>Press CTRL + O to go back where you came, keep pressing o, to repeat</li>
<li>Press CTRL + I to go Forward.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orge1c6733" class="outline-4">
<h4 id="orge1c6733"><span class="section-number-4">1.1.4</span> Matching (Parenthesis)</h4>
<div class="outline-text-4" id="text-1-1-4">
<ul class="org-ul">
<li>% → Place cursor on any (,[,{ and type % to find it's match ),] or }.</li>
</ul>
</div>
</div>
<div id="outline-container-org3ed0cf2" class="outline-4">
<h4 id="org3ed0cf2"><span class="section-number-4">1.1.5</span> Searching</h4>
<div class="outline-text-4" id="text-1-1-5">
<ul class="org-ul">
<li>/term
<ul class="org-ul">
<li>Searches for the term 'term'</li>
<li>Press 'n' and 'b' to go back and forth.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgd684e84" class="outline-4">
<h4 id="orgd684e84"><span class="section-number-4">1.1.6</span> Substitution</h4>
<div class="outline-text-4" id="text-1-1-6">
<pre class="example" id="org954148b">
:s/old/new	    → Change first occurence of "old" to "new".
:s/old/new/     → Adding the g Flag makes it Global
		      all occurences of "thee" replaced.
:#,#s/old/new/g → where #,# are the line numbers of the range
		  of lines where the substitution is to be done.
:%s/old/new/gc  → to find every occurrence in the whole file,
		  with a prompt whether to substitute or not.
</pre>
</div>
</div>

<div id="outline-container-orgd5bedfc" class="outline-4">
<h4 id="orgd5bedfc"><span class="section-number-4">1.1.7</span> Execute External Commands:</h4>
<div class="outline-text-4" id="text-1-1-7">
<ul class="org-ul">
<li>!ls → Execute ls command inside vim.</li>
</ul>
</div>
</div>

<div id="outline-container-orgdcebd36" class="outline-4">
<h4 id="orgdcebd36"><span class="section-number-4">1.1.8</span> Make External copy of current file:</h4>
<div class="outline-text-4" id="text-1-1-8">
<ul class="org-ul">
<li>:w NewFile
<ul class="org-ul">
<li>Make exact copy of current file as NewFile.</li>
<li>To save part of the file, type v, select and :w NewFile.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org7be4b1f" class="outline-4">
<h4 id="org7be4b1f"><span class="section-number-4">1.1.9</span> Retrieve &amp; Merge Files:</h4>
<div class="outline-text-4" id="text-1-1-9">
<ul class="org-ul">
<li>:r Filename
<ul class="org-ul">
<li>Insert the contents of the file Filename into the current one.</li>
</ul></li>
<li>:r !ls
<ul class="org-ul">
<li>Insert the output of ls command under your cursor &lt;3LifeHack.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org4d866b7" class="outline-4">
<h4 id="org4d866b7"><span class="section-number-4">1.1.10</span> To go insert mode:</h4>
<div class="outline-text-4" id="text-1-1-10">
<ul class="org-ul">
<li>o → open Command, puts you in I mode, to the line bellow the cursor.</li>
<li>O → Open Command, puts you in I mode, to the line Above the cursor.</li>
<li>a → Append Command, Puts you to I mode (almost same as i, A)</li>
<li>A → Append Command, Puts you to I mode, append text at the end of line.</li>
</ul>
</div>
</div>

<div id="outline-container-orgbaccb1b" class="outline-4">
<h4 id="orgbaccb1b"><span class="section-number-4">1.1.11</span> Basic Text Manipulation</h4>
<div class="outline-text-4" id="text-1-1-11">
<ul class="org-ul">
<li>R → Replace Command, Replace More than One Character.</li>
<li>y → yank=copy, type v, select text you need, type y to yank.</li>
<li>p → put=paste, move the cursor where you want, type p to put that you yanked.</li>
</ul>
</div>
</div>

<div id="outline-container-org48e718d" class="outline-4">
<h4 id="org48e718d"><span class="section-number-4">1.1.12</span> set option :set</h4>
<div class="outline-text-4" id="text-1-1-12">
<ul class="org-ul">
<li>:set ic
<ul class="org-ul">
<li>Type :set ic and /skata to search for skata (ic=IgnoreCase).</li>
<li>Type :set noic to Disable Ingoring Case.</li>
<li>Type /skata\c to Ignore Case for just this search.</li>
<li>Type :set hls is and /skata to highligt all skata occurences.</li>
<li>Type :nohlsearch to remove the highlightings.</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd7afbe5" class="outline-3">
<h3 id="orgd7afbe5"><span class="section-number-3">1.2</span> Vim Language Synopsis</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Vim's killer feature is the language it provides for making changes.
</p>
<pre class="example" id="orgacb28c5">
The Syntax of the VIM Language:
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    - Verb + Noun

    - d for Delete }
		   } =&gt; Delete Word :)
    - w for Word   }

- Commands are: Repeatable &amp; Undoable.
</pre>
</div>
