vim-cheatsheet.org
*** Verbs and Nouns in VimL
- Verbs: The operations you want to make on the text.
  + "d" → Delete
  + "dd → Delete Line.
  + "D" → Delete from Cursor pos. until end of line.(=d$)
  + "c" → Change (Delete & go to Insert Mode)
  + ">" → Indent
  + "<" → Outdent
  + "v" → Visually Select
  + "y" → Yank (copy)
  + "u" → Undo
  + "r" → Replace
  + "J" → Join current live with following one.
  + "w" → Save
  + "x" → Delete Character
  + "i" → Insert Mode.
  + "o" → open (puts you to Imode to the line bellow)
  + "O" → Open (puts you to Imode to the line above)
  + "a" → append (like i)
  + "A" → Append (Append text to the end of current line.)
  + "p" → Put (Paste)
  + "gg: → Go to 1st Line of the file.
  + "g" → (k,h,l,j): Move to logical line.
  + "G" → Go to Last Line of the file.
  + "q" → Quit.
  + "/" → Search Forward.
  + "?" → Search Backward.
  + "%" → Marching (,[,{.
  + "s" → Substitute.
  + "!" → Execute External Command.
  + "." → Repeat my previous command
  + =+++=

- Nouns: Motions.
  - "w" → Word (forward by a "word")
  - "e" → End of the word.
  - "b" → Back (back by a "word")
  - "j" → One Line Down.
  - "k" → One Line Up.
  - "0" → Start of Line
  - "$" → End of Line. (including last char.)
  - "s" → Sentence (ex: das (Delete Arround Sentence
  - "p" → Paragraph.
  - "i" → Inner (ex: ciw change all current word)
  - "a" → Arround (ex: das delete arround sent. deletes sentence & its whitespace)
  - "t" → Tag (ex: cit change inner tag
		  → change the contents of a <p>sdasew12r</p> tag;)
		  → Vim understands tags! you dont even have to be inside one.🤘
  - =+++=

- Examples:
  - "iw" → inner word (works from anywhere in the word).
  - "i"" → inner quotes.
  - "it" → inner tag (contents of HTML tag see above).
  - "ip" → inner paragraph.
  - "as" → "a sentence" (ap = a paragraph).

- Parameterized Text Objects:
  **(You have some of those on Verbs cause u're NoOb deal with it!)**
	Not Official Term, but means that they need text after them, to do something with it:
  - "f", "F" → "find" the next character(including that character).
  - "t", "T" → "find" the next character(NOT including that character).
  - "/" → Search (up to the next term).

** Some built-in configuration additions
The following settings in the next 6 sections require no plugins
to be installed, just vanilla vim or neovim.
#+BEGIN_EXAMPLE
" Enter the current millenium:
set nocompatible

" Enable syntax and plugins (for metrw)
syntax enable
filetype plugin on
#+END_EXAMPLE

*** Fuzzy Buffer File Search
Search down into subfolders
Provides tab-complition for all file-related tasks

#+BEGIN_EXAMPLE
set path +=**

" Display all matching files when we tab autocomplete
set wildmenu
#+END_EXAMPLE

NOW YOU CAN:
- Hit tad to :find by partial match
- Use * to make it fuzzy
- Remove a file from buffer with :bd
- :b lets you autocomplete any buffer:

One cool thing you can do is play with ur vim buffers finally:
( You have more that you could possibly handle! )
1. If you have multiple files opened in vim,
   you can use the :ls command, to view all opened buffers.
2. Then you can use the :b command along with a substring:
   (part of the filename of the file u need from the buffer)
   #+BEGIN_EXAMPLE
   :b flname
   #+END_EXAMPLE
   If ur substring Isn't Unique vim'll let u know.

*** Tag Jumping
Create the 'tags' file (may need ctags if urnot in Linux.)
#+BEGIN_EXAMPLE
command! MakeTags !ctags -R .
#+END_EXAMPLE
NOW YOU CAN: (^=<CTRL>)
  1. Use ^] to jump to tag under cursor.
  2. Use g^] for ambiguous tags.
  3. Use ^t to jump back up the stack.
  4. This doesn't help if you want a visual list of tags.
*** Autocomplete
The good stuff is documented in |:help ins-completion|

HIGHLIGHTS:
- ^x^n for JUST this file.
- ^x^f for filenames (works with our path tricks.) <-- FIND FLNMS in INSERT MODE!
- ^x^] for tags only
- ^n for anything specified by the 'complete' option.

NOW YOU CAN:
- Press ^n to see suggestions and
- Use ^n and ^p to go back and forth in the suggestion list menu.
- Cool if you asked me. Also:
- Type ~/Code/myPython/ ^x^f to list all files in there specifically.
  - Vim ins autocompletion supports BRE. Find out if needed.
  - Go to :help ins-completion for more crazy toys.

*** File Browsing
Tweak for browsing:
#+BEGIN_EXAMPLE
let g:netrw_banner=0		" disable annoying banner.
let g:netrw_browse_split=4	" open in prior windows.
let g:netrw_altv=1		" open splits to the right.
let g:netrw_liststyle=3		" tree view
let g:netrw_list_hide=netrw_gitignore#Hide()
let g:netrw_list_hide.=',\(^\|\s\s\)\zs\.\S\+'
#+END_EXAMPLE

NOW YOU CAN:
- :edit a folder to open a file browser.
- <CR>/v/t to open in a h-split/v-split/tab
- check ":help netrw-browse-maps" for more mappings.
*** Snippets
#+BEGIN_EXAMPLE
nnoremap ,html :-1read $HOME/.config/nvim/.skeleton.html<CR>3jwf>a
#+END_EXAMPLE

NOW YOU CAN:
- Take over the world! (with much fewer keystrokes)
- "read" => ":read file.html" put contents of file.html in my current file.
- The :-1 before the read on the command is there before read, adds a \n, and the cursor would move.
- The "3jwf" is for moving cursor in the <title>👇</title>.
*** Build Integration
Steal Mr. Bradley's formatter & add it to our =spec_helper=
[[http://philipbradley.net/rspec-into-vim-with-quickfix][http://philipbradley.net/rspec-into-vim-with-quickfix]]

Configure the 'make' command to run RSpec
#+BEGIN_EXAMPLE
set makeprg=bundle\ exec\ rspec\ -f\ QuickfixFormatter
#+END_EXAMPLE

NOW YOU CAN:

Run
- :make to run RSpec.
- :cl to list errors.
- :cc# to jump tp error by number.
- :cn and :cp to navigate back & forward.

** NeoVim User Manual Synopsis
NEOVIM USER MANUAL - by Bram Mooleanaar - Not all of it but the stuff i needed most.
