html/vim-cheatsheet.html

<div id="outline-container-org4b83ad2" class="outline-4">
<h4 id="org4b83ad2"><span class="section-number-4">1.2.1</span> Verbs and Nouns in VimL</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>Verbs: The operations you want to make on the text.
<ul class="org-ul">
<li>"d" → Delete</li>
<li>"dd → Delete Line.</li>
<li>"D" → Delete from Cursor pos. until end of line.(=d$)</li>
<li>"c" → Change (Delete &amp; go to Insert Mode)</li>
<li>"&gt;" → Indent</li>
<li>"&lt;" → Outdent</li>
<li>"v" → Visually Select</li>
<li>"y" → Yank (copy)</li>
<li>"u" → Undo</li>
<li>"r" → Replace</li>
<li>"J" → Join current live with following one.</li>
<li>"w" → Save</li>
<li>"x" → Delete Character</li>
<li>"i" → Insert Mode.</li>
<li>"o" → open (puts you to Imode to the line bellow)</li>
<li>"O" → Open (puts you to Imode to the line above)</li>
<li>"a" → append (like i)</li>
<li>"A" → Append (Append text to the end of current line.)</li>
<li>"p" → Put (Paste)</li>
<li>"gg: → Go to 1st Line of the file.</li>
<li>"g" → (k,h,l,j): Move to logical line.</li>
<li>"G" → Go to Last Line of the file.</li>
<li>"q" → Quit.</li>
<li>"/" → Search Forward.</li>
<li>"?" → Search Backward.</li>
<li>"%" → Marching (,[,{.</li>
<li>"s" → Substitute.</li>
<li>"!" → Execute External Command.</li>
<li>"." → Repeat my previous command</li>
<li><code>+++</code></li>
</ul></li>

<li>Nouns: Motions.
<ul class="org-ul">
<li>"w" → Word (forward by a "word")</li>
<li>"e" → End of the word.</li>
<li>"b" → Back (back by a "word")</li>
<li>"j" → One Line Down.</li>
<li>"k" → One Line Up.</li>
<li>"0" → Start of Line</li>
<li>"$" → End of Line. (including last char.)</li>
<li>"s" → Sentence (ex: das (Delete Arround Sentence</li>
<li>"p" → Paragraph.</li>
<li>"i" → Inner (ex: ciw change all current word)</li>
<li>"a" → Arround (ex: das delete arround sent. deletes sentence &amp; its whitespace)</li>
<li>"t" → Tag (ex: cit change inner tag
→ change the contents of a &lt;p&gt;sdasew12r&lt;/p&gt; tag;)
→ Vim understands tags! you dont even have to be inside one.🤘</li>
<li><code>+++</code></li>
</ul></li>

<li>Examples:
<ul class="org-ul">
<li>"iw" → inner word (works from anywhere in the word).</li>
<li>"i"" → inner quotes.</li>
<li>"it" → inner tag (contents of HTML tag see above).</li>
<li>"ip" → inner paragraph.</li>
<li>"as" → "a sentence" (ap = a paragraph).</li>
</ul></li>

<li>Parameterized Text Objects:
<b><b>(You have some of those on Verbs cause u're NoOb deal with it!)</b></b>
      Not Official Term, but means that they need text after them, to do something with it:
<ul class="org-ul">
<li>"f", "F" → "find" the next character(including that character).</li>
<li>"t", "T" → "find" the next character(NOT including that character).</li>
<li>"/" → Search (up to the next term).</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org351ad4d" class="outline-3">
<h3 id="org351ad4d"><span class="section-number-3">1.3</span> Some built-in configuration additions</h3>
<div class="outline-text-3" id="text-1-3">
<p>
The following settings in the next 6 sections require no plugins
to be installed, just vanilla vim or neovim.
</p>
<pre class="example" id="org752f71c">
" Enter the current millenium:
set nocompatible

" Enable syntax and plugins (for metrw)
syntax enable
filetype plugin on
</pre>
</div>

<div id="outline-container-org92065d1" class="outline-4">
<h4 id="org92065d1"><span class="section-number-4">1.3.1</span> Fuzzy Buffer File Search</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Search down into subfolders
Provides tab-complition for all file-related tasks
</p>

<pre class="example" id="org848663d">
set path +=**

" Display all matching files when we tab autocomplete
set wildmenu
</pre>

<p>
NOW YOU CAN:
</p>
<ul class="org-ul">
<li>Hit tad to :find by partial match</li>
<li>Use * to make it fuzzy</li>
<li>Remove a file from buffer with :bd</li>
<li>:b lets you autocomplete any buffer:</li>
</ul>

<p>
One cool thing you can do is play with ur vim buffers finally:
( You have more that you could possibly handle! )
</p>
<ol class="org-ol">
<li>If you have multiple files opened in vim,
you can use the :ls command, to view all opened buffers.</li>
<li><p>
Then you can use the :b command along with a substring:
(part of the filename of the file u need from the buffer)
</p>
<pre class="example" id="orgc1b85fe">
:b flname
</pre>
<p>
If ur substring Isn't Unique vim'll let u know.
</p></li>
</ol>
</div>
</div>

<div id="outline-container-orga280d46" class="outline-4">
<h4 id="orga280d46"><span class="section-number-4">1.3.2</span> Tag Jumping</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Create the 'tags' file (may need ctags if urnot in Linux.)
</p>
<pre class="example" id="org570253b">
command! MakeTags !ctags -R .
</pre>
<p>
NOW YOU CAN: (^=&lt;CTRL&gt;)
</p>
<ol class="org-ol">
<li>Use ^] to jump to tag under cursor.</li>
<li>Use g^] for ambiguous tags.</li>
<li>Use ^t to jump back up the stack.</li>
<li>This doesn't help if you want a visual list of tags.</li>
</ol>
</div>
</div>
<div id="outline-container-org97428ef" class="outline-4">
<h4 id="org97428ef"><span class="section-number-4">1.3.3</span> Autocomplete</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
The good stuff is documented in |:help ins-completion|
</p>

<p>
HIGHLIGHTS:
</p>
<ul class="org-ul">
<li>^x<sup>n</sup> for JUST this file.</li>
<li>^x<sup>f</sup> for filenames (works with our path tricks.) &lt;&#x2013; FIND FLNMS in INSERT MODE!</li>
<li>^x^] for tags only</li>
<li>^n for anything specified by the 'complete' option.</li>
</ul>

<p>
NOW YOU CAN:
</p>
<ul class="org-ul">
<li>Press ^n to see suggestions and</li>
<li>Use ^n and ^p to go back and forth in the suggestion list menu.</li>
<li>Cool if you asked me. Also:</li>
<li>Type ~/Code/myPython/ ^x<sup>f</sup> to list all files in there specifically.
<ul class="org-ul">
<li>Vim ins autocompletion supports BRE. Find out if needed.</li>
<li>Go to :help ins-completion for more crazy toys.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org825ff29" class="outline-4">
<h4 id="org825ff29"><span class="section-number-4">1.3.4</span> File Browsing</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
Tweak for browsing:
</p>
<pre class="example" id="org3246a4b">
let g:netrw_banner=0		" disable annoying banner.
let g:netrw_browse_split=4	" open in prior windows.
let g:netrw_altv=1		" open splits to the right.
let g:netrw_liststyle=3		" tree view
let g:netrw_list_hide=netrw_gitignore#Hide()
let g:netrw_list_hide.=',\(^\|\s\s\)\zs\.\S\+'
</pre>

<p>
NOW YOU CAN:
</p>
<ul class="org-ul">
<li>:edit a folder to open a file browser.</li>
<li>&lt;CR&gt;/v/t to open in a h-split/v-split/tab</li>
<li>check ":help netrw-browse-maps" for more mappings.</li>
</ul>
</div>
</div>
<div id="outline-container-orgbf18d48" class="outline-4">
<h4 id="orgbf18d48"><span class="section-number-4">1.3.5</span> Snippets</h4>
<div class="outline-text-4" id="text-1-3-5">
<pre class="example" id="org4d2052e">
nnoremap ,html :-1read $HOME/.config/nvim/.skeleton.html&lt;CR&gt;3jwf&gt;a
</pre>

<p>
NOW YOU CAN:
</p>
<ul class="org-ul">
<li>Take over the world! (with much fewer keystrokes)</li>
<li>"read" =&gt; ":read file.html" put contents of file.html in my current file.</li>
<li>The :-1 before the read on the command is there before read, adds a \n, and the cursor would move.</li>
<li>The "3jwf" is for moving cursor in the &lt;title&gt;👇&lt;/title&gt;.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd8ec742" class="outline-4">
<h4 id="orgd8ec742"><span class="section-number-4">1.3.6</span> Build Integration</h4>
<div class="outline-text-4" id="text-1-3-6">
<p>
Steal Mr. Bradley's formatter &amp; add it to our <code>spec_helper</code>
<a href="http://philipbradley.net/rspec-into-vim-with-quickfix">http://philipbradley.net/rspec-into-vim-with-quickfix</a>
</p>

<p>
Configure the 'make' command to run RSpec
</p>
<pre class="example" id="orgcda48c2">
set makeprg=bundle\ exec\ rspec\ -f\ QuickfixFormatter
</pre>

<p>
NOW YOU CAN:
</p>

<p>
Run
</p>
<ul class="org-ul">
<li>:make to run RSpec.</li>
<li>:cl to list errors.</li>
<li>:cc# to jump tp error by number.</li>
<li>:cn and :cp to navigate back &amp; forward.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgefd73d3" class="outline-3">
<h3 id="orgefd73d3"><span class="section-number-3">1.4</span> NeoVim User Manual Synopsis</h3>
<div class="outline-text-3" id="text-1-4">
<p>
NEOVIM USER MANUAL - by Bram Mooleanaar - Not all of it but the stuff i needed most.
</p>
</div>
