vim-cheatsheet.org
*** =usr_02.txt=: First Steps in Vim
1. Go to Insert Mode:	"i"
2. Go to Normal Mode:	"<ESC>"
3. Go to Command-line Mode: ":"
4. See what mode u are in: ":set showmode"
5. Move cursor left/down/up/right: "h"/"j"/"k"/"l"
6. Delete char under cursor: "x"
7. Delete line cursor is at: "dd"
8. Delete line brake (join lines): "J"
9. Undo Last Edit: "u"
10. Redo Last Undo: "<CTRL>+R"
11. Append (Go to Insert mode & Append to end of line: "a"
12. Open new line (Go to I. mode and add \n before the cursor: "o"
13. Open new line above cursor: "O"
14. You can use counts to (almost) all the above commands, examples: "3a", "3dd", "3x", "9k"
15. Getting Help (Stop Googling!): ":help {subject}"
    a. Get help for the x command: ":help x"
    b. Find out how to delete: ":help deleting"
    c. Index all Vim Commands: ":help index"
    d. Get help for CTRL+"": ":help CTRL-A"
    e. Help for CTRL+H in Normal Mode: ":help CTRL-H"
    f. Help for CTRL+H in Insert Mode: ":help i_CTRL-H"
    g. Help for cmd-line args: ":help -t"
    h. Help on cmd options: Options are enclosed with signle quotes 'opt':-> ":help 'number'"
    i. Special Keys are enclosed by <angle> brackets: ":help i_<Up>"
    j. If you see an Error you don't know of: ":help E37"
       - (like this: E37: No write since last... ...change (use ! to override))
       - DON'T PANIC copy the code "E37" and: ":help E37"
    k. Follow linkstorelatted topics:	":help usr_13.txt"
    l. Autocomplete help topics: ":help ind<Tab>" or "<CTRL>+D"
    m. For more on help see: ":help helphelp" or ":help usr_02.txt" :)
16. Save & Exit (NoBackup): "ZZ"
17. Save & Discard Changes: ":q!"

*** =usr_03.txt=: Moving Around
**** Word Movement:
1. Move (3) word(s) Forward: "3w"
2. Move backword to start of previous word: "b"
3. Move to next end of a word: "e"
4. Move to previous end of a word: "ge"
5. Make Vim consider as words, words that
	end with a non-word char like . - ... : ":set iskeyword&"
**** Moving to start or end of file:
1. Move to end of Current Line: "&"
2. Move to end of 4rth Line: "4$"
3. Move to start of Line: "0"

**** Moving to a specific character:
1. (f)ind forward in line specific char: "fx" search for "x"
   - Go to the l if the "foul" word: "3fl"
2. (F)ind backwords in line specific char: "Fx"
3. Same as f but stops one char before: "tx"
4. Same as F but stops one char before: "Tx"
5. You can repeat those 4 commands by using: ";"/","

**** Matching Parenthesis:
1. Match (,[,[ by going on top of one and: "%"

**** Moving to a specific line:
1. Go to Last line in file: "G"
2. Go to 7th line of the file: "7G"
3. Go to 1st line of the file: "gg"
4. Go to the middle of the file: "50%"
5. Go to near the end: "90%"
6. Move on top of the visible text area: "H" 1st visible line
7. Move on middle of the visible text area:	"M" Middle
8. Move to end of the visible text area: "L"	Last visible line

**** Telling where you are:
1. See current filename, line number,
   position(%), column: "<CTRL> + G"
2. Display Line Numbers: ":set number"
3. Switch of displaying line numbers: ":set nonumber"
4. Display cursor posit. in low right corner: ":set ruler"

**** Scrolling around:
1. Scrolling Carefully Up: "<CTRL> + U" or "u"
2. Scrolling Carefully Down: "<CTRL> + D" or "d"
3. Scrolling Carefully One Line Up: "<CTRL> + E" or "e"
4. Scrolling Carefully One Line Down: "<CTRL> + Y" or "y"
5. Scroll by a whole screen forward: "<CTRL> + F" or "f"
6. Scroll by a whole screen Backwards: "<CTRL> + B" or "b"
7. Scroll screen carefully down without,
   moving the cursor, to see below: "zz"
8. Save as above but puts cursor on top: "zt"
9. Save but puts cursor on the bottom: "zb"

**** Simple Searches:
1. Search for a string: ="\string_to_find"=
2. Find next occurence: "n"
3. Go to 3rd occurence: "3n"
4. Search backwards for string: "?string"
5. Find next occurence on backwards: "N"
6. Set Ignore case: ":set ignorecase"
7. Unset Ignore case: ":set noignorecase"
8. Search History: "/" or "?" and <Up>/<Down>
9. Command History: ":" and <Up>/<Down>
10. Match String to Search with cursor:	"=*="
    - Put cursor on the word and press "*"
11. Find Next Occurence of Current Word:
    - Put the cursor on top of the word, type "*"
      to grab the word as search string.
    - "#" is the same for the other direction.
    - "3*" matches the 3rd oc/nce.
12. Search for exact words:
    - "/the\" if not use \ u'll also match there, these, ...
13. Match the beginning of a word:
    - "/\<the\" search the word "the"
14. Hightlight All Occurence of a Search: ":set hlsearch"
15. Disable the above: ":set nohlsearch"
16. Just remove the hightlight:	"nohlsearch"
17. Search Specifically in the file: ":set nowrepscan"
18. Disable display anwers while typing: ":set noincsearch"
19. Set any of the above options on vimrc: ":edit ~/.config/nvim/init.vim"

**** Simple Search Patterns - Simple REs:
1. Match a word at beginning of line Only: "^the"
2. Match word at the end of a line Only: "the$"
3. Search for word at begin/end of line: "/^the" / "the$"
4. Match a line containing only the pattern: "/^the$"
5. Match any signle character: "."
6. Match special characters with eskeetit: "\.", "\^"

**** Using marks
When u move arround vim remembers the position u came from, this position is called mark.
1. Go back to your previous position: "``"
2. Jump to older positions: "<Ctrl>" + "O"
3. Jump to newer positions: "<Ctrl>" + "I" Same as <TAB>
4. Consider the following sequence:	"33G /^The CTRL + O"
5. List all positions you jumped to: ":jumps"

NAMED MARKS - Use your own marks, you can have 26 of them,
(A-Z) in your text, you cant see them, vim remembers them:
1. Mark the place under your cursor as "a":	"ma"
2. Now to go to your "a" mark use the "`":	"`a"
3. Go to the beginning of the line that contains the mark: "'a" (single quote')
4. A good usage is the following:
   Put a mark "s" for start at the start of the file u're working,
   and a "e" end mark at the end of the file and go back and
   forth easilly with: "'s" / "'e"
5. List all marks: ":marks"
6. Some Special Marks:
   - The cursor position before doing a jump: "'"
   - The cursor position when last editing the file: '"'
   - Start of the last change: "["
   - End of the last change: "]"

*** =usr_04.txt=: Making Small Changes
**** Operators and Motions
1. Delete 2 words (w): "d2w"
2. Delete 2 words up until the last char (e): "d2e" (delete 2 end)
3. Delete from cursor until end of line: "d$"
4. Operate on any text u can move over: "d4k"
