html/vim-cheatsheet.html
<div id="outline-container-orgf9260c4" class="outline-4">
<h4 id="orgf9260c4"><span class="section-number-4">1.4.1</span> <code>usr_02.txt</code>: First Steps in Vim</h4>
<div class="outline-text-4" id="text-1-4-1">
<ol class="org-ol">
<li>Go to Insert Mode:	"i"</li>
<li>Go to Normal Mode:	"&lt;ESC&gt;"</li>
<li>Go to Command-line Mode: ":"</li>
<li>See what mode u are in: ":set showmode"</li>
<li>Move cursor left/down/up/right: "h"<i>"j"</i>"k"/"l"</li>
<li>Delete char under cursor: "x"</li>
<li>Delete line cursor is at: "dd"</li>
<li>Delete line brake (join lines): "J"</li>
<li>Undo Last Edit: "u"</li>
<li>Redo Last Undo: "&lt;CTRL&gt;+R"</li>
<li>Append (Go to Insert mode &amp; Append to end of line: "a"</li>
<li>Open new line (Go to I. mode and add \n before the cursor: "o"</li>
<li>Open new line above cursor: "O"</li>
<li>You can use counts to (almost) all the above commands, examples: "3a", "3dd", "3x", "9k"</li>
<li><p>
Getting Help (Stop Googling!): ":help {subject}"
a. Get help for the x command: ":help x"
b. Find out how to delete: ":help deleting"
c. Index all Vim Commands: ":help index"
d. Get help for CTRL+"": ":help CTRL-A"
e. Help for CTRL+H in Normal Mode: ":help CTRL-H"
f. Help for CTRL+H in Insert Mode: ":help i<sub>CTRL</sub>-H"
g. Help for cmd-line args: ":help -t"
h. Help on cmd options: Options are enclosed with signle quotes 'opt':-&gt; ":help 'number'"
i. Special Keys are enclosed by &lt;angle&gt; brackets: ":help i_&lt;Up&gt;"
j. If you see an Error you don't know of: ":help E37"
</p>
<ul class="org-ul">
<li>(like this: E37: No write since last&#x2026; &#x2026;change (use ! to override))</li>
<li>DON'T PANIC copy the code "E37" and: ":help E37"</li>
</ul>
<p>
k. Follow linkstorelatted topics:	":help usr<sub>13.txt</sub>"
l. Autocomplete help topics: ":help ind&lt;Tab&gt;" or "&lt;CTRL&gt;+D"
m. For more on help see: ":help helphelp" or ":help usr<sub>02.txt</sub>" :)
</p></li>
<li>Save &amp; Exit (NoBackup): "ZZ"</li>
<li>Save &amp; Discard Changes: ":q!"</li>
</ol>
</div>
</div>

<div id="outline-container-orgd242270" class="outline-4">
<h4 id="orgd242270"><span class="section-number-4">1.4.2</span> <code>usr_03.txt</code>: Moving Around</h4>
<div class="outline-text-4" id="text-1-4-2">
</div>
<ol class="org-ol">
<li><a id="orgd8ba558"></a>Word Movement:<br />
<div class="outline-text-5" id="text-1-4-2-1">
<ol class="org-ol">
<li>Move (3) word(s) Forward: "3w"</li>
<li>Move backword to start of previous word: "b"</li>
<li>Move to next end of a word: "e"</li>
<li>Move to previous end of a word: "ge"</li>
<li>Make Vim consider as words, words that
end with a non-word char like . - &#x2026; : ":set iskeyword&amp;"</li>
</ol>
</div>
</li>
<li><a id="org550305a"></a>Moving to start or end of file:<br />
<div class="outline-text-5" id="text-1-4-2-2">
<ol class="org-ol">
<li>Move to end of Current Line: "&amp;"</li>
<li>Move to end of 4rth Line: "4$"</li>
<li>Move to start of Line: "0"</li>
</ol>
</div>
</li>

<li><a id="orge6ee572"></a>Moving to a specific character:<br />
<div class="outline-text-5" id="text-1-4-2-3">
<ol class="org-ol">
<li>(f)ind forward in line specific char: "fx" search for "x"
<ul class="org-ul">
<li>Go to the l if the "foul" word: "3fl"</li>
</ul></li>
<li>(F)ind backwords in line specific char: "Fx"</li>
<li>Same as f but stops one char before: "tx"</li>
<li>Same as F but stops one char before: "Tx"</li>
<li>You can repeat those 4 commands by using: ";"/","</li>
</ol>
</div>
</li>

<li><a id="orgc60e587"></a>Matching Parenthesis:<br />
<div class="outline-text-5" id="text-1-4-2-4">
<ol class="org-ol">
<li>Match (,[,[ by going on top of one and: "%"</li>
</ol>
</div>
</li>

<li><a id="orge75e46a"></a>Moving to a specific line:<br />
<div class="outline-text-5" id="text-1-4-2-5">
<ol class="org-ol">
<li>Go to Last line in file: "G"</li>
<li>Go to 7th line of the file: "7G"</li>
<li>Go to 1st line of the file: "gg"</li>
<li>Go to the middle of the file: "50%"</li>
<li>Go to near the end: "90%"</li>
<li>Move on top of the visible text area: "H" 1st visible line</li>
<li>Move on middle of the visible text area:	"M" Middle</li>
<li>Move to end of the visible text area: "L"	Last visible line</li>
</ol>
</div>
</li>

<li><a id="org53a7e5f"></a>Telling where you are:<br />
<div class="outline-text-5" id="text-1-4-2-6">
<ol class="org-ol">
<li>See current filename, line number,
position(%), column: "&lt;CTRL&gt; + G"</li>
<li>Display Line Numbers: ":set number"</li>
<li>Switch of displaying line numbers: ":set nonumber"</li>
<li>Display cursor posit. in low right corner: ":set ruler"</li>
</ol>
</div>
</li>

<li><a id="org3da02ad"></a>Scrolling around:<br />
<div class="outline-text-5" id="text-1-4-2-7">
<ol class="org-ol">
<li>Scrolling Carefully Up: "&lt;CTRL&gt; + U" or "u"</li>
<li>Scrolling Carefully Down: "&lt;CTRL&gt; + D" or "d"</li>
<li>Scrolling Carefully One Line Up: "&lt;CTRL&gt; + E" or "e"</li>
<li>Scrolling Carefully One Line Down: "&lt;CTRL&gt; + Y" or "y"</li>
<li>Scroll by a whole screen forward: "&lt;CTRL&gt; + F" or "f"</li>
<li>Scroll by a whole screen Backwards: "&lt;CTRL&gt; + B" or "b"</li>
<li>Scroll screen carefully down without,
moving the cursor, to see below: "zz"</li>
<li>Save as above but puts cursor on top: "zt"</li>
<li>Save but puts cursor on the bottom: "zb"</li>
</ol>
</div>
</li>

<li><a id="org5fec0f8"></a>Simple Searches:<br />
<div class="outline-text-5" id="text-1-4-2-8">
<ol class="org-ol">
<li>Search for a string: <code>"\string_to_find"</code></li>
<li>Find next occurence: "n"</li>
<li>Go to 3rd occurence: "3n"</li>
<li>Search backwards for string: "?string"</li>
<li>Find next occurence on backwards: "N"</li>
<li>Set Ignore case: ":set ignorecase"</li>
<li>Unset Ignore case: ":set noignorecase"</li>
<li>Search History: "/" or "?" and &lt;Up&gt;/&lt;Down&gt;</li>
<li>Command History: ":" and &lt;Up&gt;/&lt;Down&gt;</li>
<li>Match String to Search with cursor:	"<code>*</code>"
<ul class="org-ul">
<li>Put cursor on the word and press "*"</li>
</ul></li>
<li>Find Next Occurence of Current Word:
<ul class="org-ul">
<li>Put the cursor on top of the word, type "*"
to grab the word as search string.</li>
<li>"#" is the same for the other direction.</li>
<li>"3*" matches the 3rd oc/nce.</li>
</ul></li>
<li>Search for exact words:
<ul class="org-ul">
<li>"/the\" if not use \ u'll also match there, these, &#x2026;</li>
</ul></li>
<li>Match the beginning of a word:
<ul class="org-ul">
<li>"/\&lt;the\" search the word "the"</li>
</ul></li>
<li>Hightlight All Occurence of a Search: ":set hlsearch"</li>
<li>Disable the above: ":set nohlsearch"</li>
<li>Just remove the hightlight:	"nohlsearch"</li>
<li>Search Specifically in the file: ":set nowrepscan"</li>
<li>Disable display anwers while typing: ":set noincsearch"</li>
<li>Set any of the above options on vimrc: ":edit ~/.config/nvim/init.vim"</li>
</ol>
</div>
</li>

<li><a id="orgf6c5ea1"></a>Simple Search Patterns - Simple REs:<br />
<div class="outline-text-5" id="text-1-4-2-9">
<ol class="org-ol">
<li>Match a word at beginning of line Only: "<sup>the</sup>"</li>
<li>Match word at the end of a line Only: "the$"</li>
<li>Search for word at begin/end of line: "/<sup>the</sup>" / "the$"</li>
<li>Match a line containing only the pattern: "/<sup>the</sup>$"</li>
<li>Match any signle character: "."</li>
<li>Match special characters with eskeetit: "\.", "\^"</li>
</ol>
</div>
</li>

<li><a id="org44a9b51"></a>Using marks<br />
<div class="outline-text-5" id="text-1-4-2-10">
<p>
When u move arround vim remembers the position u came from, this position is called mark.
</p>
<ol class="org-ol">
<li>Go back to your previous position: "``"</li>
<li>Jump to older positions: "&lt;Ctrl&gt;" + "O"</li>
<li>Jump to newer positions: "&lt;Ctrl&gt;" + "I" Same as &lt;TAB&gt;</li>
<li>Consider the following sequence:	"33G /<sup>The</sup> CTRL + O"</li>
<li>List all positions you jumped to: ":jumps"</li>
</ol>

<p>
NAMED MARKS - Use your own marks, you can have 26 of them,
(A-Z) in your text, you cant see them, vim remembers them:
</p>
<ol class="org-ol">
<li>Mark the place under your cursor as "a":	"ma"</li>
<li>Now to go to your "a" mark use the "`":	"`a"</li>
<li>Go to the beginning of the line that contains the mark: "'a" (single quote')</li>
<li>A good usage is the following:
Put a mark "s" for start at the start of the file u're working,
and a "e" end mark at the end of the file and go back and
forth easilly with: "'s" / "'e"</li>
<li>List all marks: ":marks"</li>
<li>Some Special Marks:
<ul class="org-ul">
<li>The cursor position before doing a jump: "'"</li>
<li>The cursor position when last editing the file: '"'</li>
<li>Start of the last change: "["</li>
<li>End of the last change: "]"</li>
</ul></li>
</ol>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgf8ef476" class="outline-4">
<h4 id="orgf8ef476"><span class="section-number-4">1.4.3</span> <code>usr_04.txt</code>: Making Small Changes</h4>
<div class="outline-text-4" id="text-1-4-3">
</div>
<ol class="org-ol">
<li><a id="org21626ab"></a>Operators and Motions<br />
<div class="outline-text-5" id="text-1-4-3-1">
<ol class="org-ol">
<li>Delete 2 words (w): "d2w"</li>
<li>Delete 2 words up until the last char (e): "d2e" (delete 2 end)</li>
<li>Delete from cursor until end of line: "d$"</li>
<li>Operate on any text u can move over: "d4k"</li>
</ol>
</div>
</li>
