vim-cheatsheet.org
**** Changing Text
1. Replace part of a line with ur string: "c2wbe<Esc>"
   - "c": the change operator.
   - "2w": move two words (they're deleted and Insert mode started)
   - "be": insert this text <Esc> back to Normal Mode. Cool ;)
2. Delete a Whole Line: "dd"
   a. Delete to the end of Line: "d$"
   b. Delete to the end of Line: "D"
3. Change a Whole Line: "cc"
   a. Change a Whole Line: "S"
   b. Change to the end of Line: "c$"
   c. Change to the end of Line: "C"
**** SHORTCUTS:
Some operator-motion commands are used so often that they
have been given a single letter command:
- x stands for dl (delete character under cursor)
- X stands for dh (delete character left of the cursor)
- D stands for d$ (delete to the end of the line)
- C stands for c$ (change to the end of the line)
- s stands for cl (change one character)
- S stands for cc (change a whole line)
**** WHERE TO PUT THE COUNT:
1. Delete 1 word 3 times: "3dw"
2. Delete 3 words 1 time: "d3w"
3. Delete 2 words, repeated 3 times for a total of 6 words: "3d2w"
**** REPLACING WITH ONE CHARACTER:
1. Replace char with "T" in NormalMode: "rT"
2. Replace 5 chars with "x"s in NormalMode: "5rx"
3. Replace 4 characters with breakline: "4r<Enter>"
**** Repeating a Change
1. Repeat the last change: "."
**** Visual Mode - (v/V)
1. Select text: "v" + movement(h/j/k/l)
2. Select text to delete: "v" + movement + "d"
3. Select WHole Lines: "V"+ movement + action
4. Select Blocks (like tables): "<Ctrl>+V" + move + act
5. Go to end the selection: "o"
**** Moving Text
When you Delete something with "d", "x", or another command,
the text is saved. You can paste it back by using the "p" put command.
1. Put deleted text before the cursor: "p"
2. Put deleted text before the cursor: "P"
3. You can repeat p/P as many times you need, the same text will be printed.
4. Put deleted text 3times: "3p"
5. Swap 2 characters("teh"~>"the"): "xp" 1st move cursor on the "e"
**** Copying - Yanking Text - Inside vim
1. Yank selected text: "y"
2. Yank word: "yw"
3. Yank 2 words: "y2w"
4. Yank 2 words without whitespaces: "y2e"
5. Yank whole line:"yy" or "Y"
6. Delete from cursor until end: "D"
7. Yank from cursor until end of line: "y$"
**** Using the Clipboard - (y + p + "*)
1. Yank line into clipboard: "*yy
2. Put text from clipboard into text: "*p
**** Text objects
These commands move over three kinds of text objects:
Sentence, Paragraph, Section
1. Delete A Word under cursor no whitespace: "diw"
2. Delete Word under cursor with whitespace: "daw"
3. Change Inner Sentence: "cis"
4. Same as above, includes whitespace: "cas"
5. Delete Until End of file: "dG"
6. Delete Until Start of file: "dgg"
7. text-objects-summary:
   1. sentences backward: "("
   2. sentences forward: ")"
   3. paragraph backward: "{"
   4. paragraph forward: "}"
   5. section forward or to the next '{': "]]"
   6. section forward or to the next '}': "]["
   7. section backward or to previous '{': "[["
   8. section backward or to previous '}': "[]"
**** Replace mode - R
1. The R command cause vim to enter the replace mode.
   In this mode every character u type replaces the one
   under ur cursor, until u press <Esc>
2. Switch from Replace to Insert mode: "<Insert>"

*** more someday...
** Let vim do the typing
Let Vim do the typing - Insert Mode
- Insert Text from a Register: "<Ctrl> + r"
- Last Inserted text: "<Ctrl> + a"
- Go to sub completion mode: "<Ctrl> + x"
- Tag Completion: "<Ctrl> + x + <Ctrl> + ]"
- Filename Completion: "<Ctrl> + x + <Ctrl> + f"
- Context Aware Word Completion: "<Ctrl> + x + <Ctrl> + p"
- Same as above but searches forward: "<Ctrl> + x + <Ctrl> + n"
- Context Aware Line Completion: "<Ctrl> + x + <Ctrl> + l"
- Omni Completion (ex python methods): "<Ctrl> + x + <Ctrl> + o"
- Where vim looks for completion: ":set complete"
- To add there: ":set complete+=i,kspell"

** More Unsorted Magic
- To delete forward up to character: "'X' type dtX"
- To delete forward through character: "'X' type dfX"
- To delete backward up to character: "'X' type dTX"
- To delete backward through character: "'X' type dFX"
- Open Multiple Files in buffers: ":n file1 file2"
- Loop through Multiple Files in ur buffers: ":b <Tab>" (:b<space><Tab>)
- Create visual block: "<Ctrl> + v"
- Comment Mupliple Lines: Ctrl + v from down to up, Shift + I, type the comment char (#, //), and press Esc
