html/vim-cheatsheet.html
<li><a id="org5ab0502"></a>Changing Text<br />
<div class="outline-text-5" id="text-1-4-3-2">
<ol class="org-ol">
<li>Replace part of a line with ur string: "c2wbe&lt;Esc&gt;"
<ul class="org-ul">
<li>"c": the change operator.</li>
<li>"2w": move two words (they're deleted and Insert mode started)</li>
<li>"be": insert this text &lt;Esc&gt; back to Normal Mode. Cool ;)</li>
</ul></li>
<li>Delete a Whole Line: "dd"
a. Delete to the end of Line: "d$"
b. Delete to the end of Line: "D"</li>
<li>Change a Whole Line: "cc"
a. Change a Whole Line: "S"
b. Change to the end of Line: "c$"
c. Change to the end of Line: "C"</li>
</ol>
</div>
</li>
<li><a id="org5db9b30"></a>SHORTCUTS:<br />
<div class="outline-text-5" id="text-1-4-3-3">
<p>
Some operator-motion commands are used so often that they
have been given a single letter command:
</p>
<ul class="org-ul">
<li>x stands for dl (delete character under cursor)</li>
<li>X stands for dh (delete character left of the cursor)</li>
<li>D stands for d$ (delete to the end of the line)</li>
<li>C stands for c$ (change to the end of the line)</li>
<li>s stands for cl (change one character)</li>
<li>S stands for cc (change a whole line)</li>
</ul>
</div>
</li>
<li><a id="org0824f55"></a>WHERE TO PUT THE COUNT:<br />
<div class="outline-text-5" id="text-1-4-3-4">
<ol class="org-ol">
<li>Delete 1 word 3 times: "3dw"</li>
<li>Delete 3 words 1 time: "d3w"</li>
<li>Delete 2 words, repeated 3 times for a total of 6 words: "3d2w"</li>
</ol>
</div>
</li>
<li><a id="orge7e91b0"></a>REPLACING WITH ONE CHARACTER:<br />
<div class="outline-text-5" id="text-1-4-3-5">
<ol class="org-ol">
<li>Replace char with "T" in NormalMode: "rT"</li>
<li>Replace 5 chars with "x"s in NormalMode: "5rx"</li>
<li>Replace 4 characters with breakline: "4r&lt;Enter&gt;"</li>
</ol>
</div>
</li>
<li><a id="org80808af"></a>Repeating a Change<br />
<div class="outline-text-5" id="text-1-4-3-6">
<ol class="org-ol">
<li>Repeat the last change: "."</li>
</ol>
</div>
</li>
<li><a id="org15d63db"></a>Visual Mode - (v/V)<br />
<div class="outline-text-5" id="text-1-4-3-7">
<ol class="org-ol">
<li>Select text: "v" + movement(h/j/k/l)</li>
<li>Select text to delete: "v" + movement + "d"</li>
<li>Select WHole Lines: "V"+ movement + action</li>
<li>Select Blocks (like tables): "&lt;Ctrl&gt;+V" + move + act</li>
<li>Go to end the selection: "o"</li>
</ol>
</div>
</li>
<li><a id="org89654e2"></a>Moving Text<br />
<div class="outline-text-5" id="text-1-4-3-8">
<p>
When you Delete something with "d", "x", or another command,
the text is saved. You can paste it back by using the "p" put command.
</p>
<ol class="org-ol">
<li>Put deleted text before the cursor: "p"</li>
<li>Put deleted text before the cursor: "P"</li>
<li>You can repeat p/P as many times you need, the same text will be printed.</li>
<li>Put deleted text 3times: "3p"</li>
<li>Swap 2 characters("teh"~&gt;"the"): "xp" 1st move cursor on the "e"</li>
</ol>
</div>
</li>
<li><a id="org3b55a70"></a>Copying - Yanking Text - Inside vim<br />
<div class="outline-text-5" id="text-1-4-3-9">
<ol class="org-ol">
<li>Yank selected text: "y"</li>
<li>Yank word: "yw"</li>
<li>Yank 2 words: "y2w"</li>
<li>Yank 2 words without whitespaces: "y2e"</li>
<li>Yank whole line:"yy" or "Y"</li>
<li>Delete from cursor until end: "D"</li>
<li>Yank from cursor until end of line: "y$"</li>
</ol>
</div>
</li>
<li><a id="orgbcdc56c"></a>Using the Clipboard - (y + p + "*)<br />
<div class="outline-text-5" id="text-1-4-3-10">
<ol class="org-ol">
<li>Yank line into clipboard: "*yy</li>
<li>Put text from clipboard into text: "*p</li>
</ol>
</div>
</li>
<li><a id="org530bab0"></a>Text objects<br />
<div class="outline-text-5" id="text-1-4-3-11">
<p>
These commands move over three kinds of text objects:
Sentence, Paragraph, Section
</p>
<ol class="org-ol">
<li>Delete A Word under cursor no whitespace: "diw"</li>
<li>Delete Word under cursor with whitespace: "daw"</li>
<li>Change Inner Sentence: "cis"</li>
<li>Same as above, includes whitespace: "cas"</li>
<li>Delete Until End of file: "dG"</li>
<li>Delete Until Start of file: "dgg"</li>
<li>text-objects-summary:
<ol class="org-ol">
<li>sentences backward: "("</li>
<li>sentences forward: ")"</li>
<li>paragraph backward: "{"</li>
<li>paragraph forward: "}"</li>
<li>section forward or to the next '{': "]]"</li>
<li>section forward or to the next '}': "]["</li>
<li>section backward or to previous '{': "[["</li>
<li>section backward or to previous '}': "[]"</li>
</ol></li>
</ol>
</div>
</li>
<li><a id="org7373332"></a>Replace mode - R<br />
<div class="outline-text-5" id="text-1-4-3-12">
<ol class="org-ol">
<li>The R command cause vim to enter the replace mode.
In this mode every character u type replaces the one
under ur cursor, until u press &lt;Esc&gt;</li>
<li>Switch from Replace to Insert mode: "&lt;Insert&gt;"</li>
</ol>
</div>
</li>
</ol>
</div>

<div id="outline-container-org0e94216" class="outline-4">
<h4 id="org0e94216"><span class="section-number-4">1.4.4</span> more someday&#x2026;</h4>
</div>
</div>
<div id="outline-container-orgb3dca9c" class="outline-3">
<h3 id="orgb3dca9c"><span class="section-number-3">1.5</span> Let vim do the typing</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Let Vim do the typing - Insert Mode
</p>
<ul class="org-ul">
<li>Insert Text from a Register: "&lt;Ctrl&gt; + r"</li>
<li>Last Inserted text: "&lt;Ctrl&gt; + a"</li>
<li>Go to sub completion mode: "&lt;Ctrl&gt; + x"</li>
<li>Tag Completion: "&lt;Ctrl&gt; + x + &lt;Ctrl&gt; + ]"</li>
<li>Filename Completion: "&lt;Ctrl&gt; + x + &lt;Ctrl&gt; + f"</li>
<li>Context Aware Word Completion: "&lt;Ctrl&gt; + x + &lt;Ctrl&gt; + p"</li>
<li>Same as above but searches forward: "&lt;Ctrl&gt; + x + &lt;Ctrl&gt; + n"</li>
<li>Context Aware Line Completion: "&lt;Ctrl&gt; + x + &lt;Ctrl&gt; + l"</li>
<li>Omni Completion (ex python methods): "&lt;Ctrl&gt; + x + &lt;Ctrl&gt; + o"</li>
<li>Where vim looks for completion: ":set complete"</li>
<li>To add there: ":set complete+=i,kspell"</li>
</ul>
</div>
</div>

<div id="outline-container-orgb66c9af" class="outline-3">
<h3 id="orgb66c9af"><span class="section-number-3">1.6</span> More Unsorted Magic</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>To delete forward up to character: "'X' type dtX"</li>
<li>To delete forward through character: "'X' type dfX"</li>
<li>To delete backward up to character: "'X' type dTX"</li>
<li>To delete backward through character: "'X' type dFX"</li>
<li>Open Multiple Files in buffers: ":n file1 file2"</li>
<li>Loop through Multiple Files in ur buffers: ":b &lt;Tab&gt;" (:b&lt;space&gt;&lt;Tab&gt;)</li>
<li>Create visual block: "&lt;Ctrl&gt; + v"</li>
<li>Comment Mupliple Lines: Ctrl + v from down to up, Shift + I, type the comment char (#, //), and press Esc</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Manos Vasilakis (advizor.gr)</p>
<p class="date">Created: 2021-09-16 Thu 22:51</p>
</div>
</body>
</html>
